"""
[テストドリブン3]
まずは仕様からテストコードを作成し、その後にプログラムを作成してください。


[関数仕様]
--- --- ---
機能
  100を入力された整数で割った余りを返すプログラム。
  また、文字列型の入力があった場合、数値に変換して出力すること。この場合、警告メッセージを出力すること。

--- --- ---
関数名
  calc_modulo_100_divide_by_input

--- --- ---
例外パターンとメッセージ
  - 小数や有理数、無理数が入力された場合
      → エラーメッセージ：数値は整数型のみ有効です。
  - 上記以外の入力があった場合
      → エラーメッセージ：意図しない型での入力です。
  - 0が入力された場合
      → エラーメッセージ：0の入力は受け付けていません。
--- --- ---
警告パターンとメッセージ
  - 文字列の数値が入力された場合
      → 警告メッセージ：文字列型でなく整数の入力が推奨されます。意図しない出力が行われる可能性があります。
"""

def calc_modulo_100_divide_by_input():
    pass
